nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso54s018/demo_apps/touch_cursor/pin_mux.c
    const uint32_t LCD_VD13 = (/* Pin is configured as LCD_VD(13) */
                               IOCON_PIO_FUNC1 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN31 (coords: D14) is configured as LCD_VD(13) */
    IOCON_PinMuxSet(IOCON, BOARD_LCD_VD13_PORT, BOARD_LCD_VD13_PIN, LCD_VD13);

    const uint32_t LCD_VD14 = (/* Pin is configured as LCD_VD(14) */
                               IOCON_PIO_FUNC1 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN0 (coords: D12) is configured as LCD_VD(14) */
    IOCON_PinMuxSet(IOCON, BOARD_LCD_VD14_PORT, BOARD_LCD_VD14_PIN, LCD_VD14);

    const uint32_t LCD_VD15 = (/* Pin is configured as LCD_VD(15) */
                               IOCON_PIO_FUNC1 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN1 (coords: D11) is configured as LCD_VD(15) */
    IOCON_PinMuxSet(IOCON, BOARD_LCD_VD15_PORT, BOARD_LCD_VD15_PIN, LCD_VD15);

    const uint32_t FC2_SDAX = (/* Pin is configured as FC2_CTS_SDA_SSEL0 */
                               IOCON_PIO_FUNC1 |
                               /* I2C mode */
                               IOCON_PIO_I2CSLEW_I2C |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* High drive: 20 mA */
                               IOCON_PIO_I2CDRIVE_HIGH |
                               /* I2C 50 ns glitch filter enabled */
                               IOCON_PIO_I2CFILTER_EN);
    /* PORT3 PIN23 (coords: C2) is configured as FC2_CTS_SDA_SSEL0 */
    IOCON_PinMuxSet(IOCON, BOARD_FC2_SDAX_PORT, BOARD_FC2_SDAX_PIN, FC2_SDAX);

    const uint32_t FC2_SCLX = (/* Pin is configured as FC2_RTS_SCL_SSEL1 */
                               IOCON_PIO_FUNC1 |
                               /* I2C mode */
                               IOCON_PIO_I2CSLEW_I2C |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* High drive: 20 mA */
                               IOCON_PIO_I2CDRIVE_HIGH |
                               /* I2C 50 ns glitch filter enabled */
                               IOCON_PIO_I2CFILTER_EN);
    /* PORT3 PIN24 (coords: E2) is configured as FC2_RTS_SCL_SSEL1 */
    IOCON_PinMuxSet(IOCON, BOARD_FC2_SCLX_PORT, BOARD_FC2_SCLX_PIN, FC2_SCLX);

    const uint32_t port3_pin31_config = (/* Pin is configured as PIO3_31 */
                                         IOCON_PIO_FUNC0 |
                                         /* Selects pull-up function */
                                         IOCON_PIO_MODE_PULLUP |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Input filter disabled */
                                         IOCON_PIO_INPFILT_OFF |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN31 (coords: J14) is configured as PIO3_31 */
    IOCON_PinMuxSet(IOCON, 3U, 31U, port3_pin31_config);

    const uint32_t LCD_VD19 = (/* Pin is configured as LCD_VD(19) */
                               IOCON_PIO_FUNC1 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN5 (coords: B10) is configured as LCD_VD(19) */
    IOCON_PinMuxSet(IOCON, BOARD_LCD_VD19_PORT, BOARD_LCD_VD19_PIN, LCD_VD19);

