nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso54s018/demo_apps/touch_cursor/pin_mux.c
    const uint32_t LCD_VD20 = (/* Pin is configured as LCD_VD(20) */
                               IOCON_PIO_FUNC1 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN6 (coords: C9) is configured as LCD_VD(20) */
    IOCON_PinMuxSet(IOCON, BOARD_LCD_VD20_PORT, BOARD_LCD_VD20_PIN, LCD_VD20);

    const uint32_t LCD_VD21 = (/* Pin is configured as LCD_VD(21) */
                               IOCON_PIO_FUNC1 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN7 (coords: B8) is configured as LCD_VD(21) */
    IOCON_PinMuxSet(IOCON, BOARD_LCD_VD21_PORT, BOARD_LCD_VD21_PIN, LCD_VD21);

    const uint32_t LCD_VD22 = (/* Pin is configured as LCD_VD(22) */
                               IOCON_PIO_FUNC1 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN8 (coords: A7) is configured as LCD_VD(22) */
    IOCON_PinMuxSet(IOCON, BOARD_LCD_VD22_PORT, BOARD_LCD_VD22_PIN, LCD_VD22);

    const uint32_t LCD_VD23 = (/* Pin is configured as LCD_VD(23) */
                               IOCON_PIO_FUNC1 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Input filter disabled */
                               IOCON_PIO_INPFILT_OFF |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN9 (coords: C7) is configured as LCD_VD(23) */
    IOCON_PinMuxSet(IOCON, BOARD_LCD_VD23_PORT, BOARD_LCD_VD23_PIN, LCD_VD23);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
